In [2]:
from IPython.core.display import display, HTML
display(HTML("<style>.container { width:100% !important; }</style>"))

import pandas as pd
import numpy as np

In [24]:
df1 = pd.DataFrame({
    'First Code' : [456, 123],
    'First Alias': ['xyz','abc'],
    'Second Code': [465, 124],
    'Second Alias': ['zyx','abc']
})

In [25]:
df1

   First Code First Alias  Second Code Second Alias
0         456         xyz          465          zyx
1         123         abc          124          abc

In [26]:
df2 = pd.DataFrame({
    'some_alias': ['asd', 'abc', 'xyz'],
    'code 1': [0, 0, 0],
    'code 2': [0, 0, 0]
})

In [29]:
df2

  some_alias  code 1  code 2
0        asd       0       0
1        abc       0       0
2        xyz       0       0

In [30]:
for index, rows in df2.iterrows():
    if(rows['some_alias'] is df1['First Alias'] or df1['First Alias']).all():
        df2.sort_index(inplace=True)
        df1.sort_index(inplace=True)
        df2[['code 1', 'code 2']] = df1[['First Code', 'Second Code']]

df2

  some_alias  code 1  code 2
0        asd   456.0   465.0
1        abc   123.0   124.0
2        xyz     NaN     NaN

In [27]:
df3 = pd.DataFrame({
    'some_alias': ['asd', 'abc', 'xyz'],
    'code 1': [np.nan, 123, 456],
    'code 2': [np.nan, 124, 465]
})

#Expected Outcome

In [28]:
df3

  some_alias  code 1  code 2
0        asd     NaN     NaN
1        abc   123.0   124.0
2        xyz   456.0   465.0